Enums/СостоянияЗагрузкиКандидатовИзИнтернета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияЗагрузкиКандидатовИзИнтернета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактыЗакрыты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьОднофамильцы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЗагрузкиКандидатовИзИнтернета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НеЗагруженные() Экспорт
	Возврат ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(
		Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.ОшибкаЗагрузки, 
		Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.КонтактыЗакрыты,
		Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.ЕстьОднофамильцы);
КонецФункции

Функция Зависшие() Экспорт
	
	Зависшие = Новый Массив();
	Зависшие.Добавить(Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.Зарегистрирован);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Зависшие, НеЗагруженные());
	
	Возврат Зависшие;
	
КонецФункции

Функция КартинкаПоСостоянию(Состояние) Экспорт
	
	Картинки = Новый Соответствие;
	Картинки.Вставить(Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.ЕстьОднофамильцы, 
		БиблиотекаКартинок.СостояниеЗагрузкиКандидатаИзИнтернетаЕстьОднофамильцы);
	Картинки.Вставить(Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.КонтактыЗакрыты, 
		БиблиотекаКартинок.СостояниеЗагрузкиКандидатаИзИнтернетаКонтактыЗакрыты);
	Картинки.Вставить(Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.ОшибкаЗагрузки, 
		БиблиотекаКартинок.СостояниеЗагрузкиКандидатаИзИнтернетаОшибка);
	
	Возврат Картинки[Состояние];
	
КонецФункции

#КонецОбласти

#КонецЕсли
